In [1]:
# Pandas
# pandas series object is one dimensional labeled array
import pandas as pd
s1 = pd.Series([1,2,3,4,5]) # S will be capital
type(s1)
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [2]:
# changing index
s1=pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
s1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [3]:
# series object from dictionary
import pandas as pd
pd.Series({'a':10,'b':20,'c':30})

a    10
b    20
c    30
dtype: int64

In [4]:
# changing index position
import pandas as pd
pd.Series({'a':10,'b':20,'c':30},index = ['b','c','d','a'])

b    20.0
c    30.0
d     NaN
a    10.0
dtype: float64

In [5]:
# extracting individual elements
s1 = pd.Series([1,2,3,4,5]) # extracting a single element
s1[4]

5

In [6]:
s1 = pd.Series([1,2,3,4,5]) # extracting elements from back
s1[-3:]

2    3
3    4
4    5
dtype: int64

In [7]:
s1 = pd.Series([1,2,3,4,5]) # extracting a sequence of elements
s1[:4]

0    1
1    2
2    3
3    4
dtype: int64

In [8]:
l = [1,2,3,4,5]
s1 = pd.Series(l) # extracting a single element
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [9]:
# basic math operations on series
s1 + 100
s1 * 5
s1 - 100
s1 / 2

0    0.5
1    1.0
2    1.5
3    2.0
4    2.5
dtype: float64

In [10]:
s1 = pd.Series([1,2,3,4,5])
s2 = pd.Series([10,20,30,40,50])
s = s1 + s2
s

0    11
1    22
2    33
3    44
4    55
dtype: int64

In [11]:
# pandas dataframe
import pandas as pd
pd.DataFrame({"Name":['bob','sam','anne'],"marks":[24,53,25,]})

   Name  marks
0   bob     24
1   sam     53
2  anne     25

In [12]:
# dataframe in built functions
iris = pd.read_csv('table.csv')
iris.tail(2)
# iris.head(2)
iris.shape
iris.describe()
iris

   Unnamed: 0    name  marks       city
0           0   harry     92     rampur
1           1   rohan     34    kolkata
2           2  skillf     24   bareilly
3           3   shubh     17  antartica

In [13]:
# iloc[]
iris = pd.read_csv('table.csv')
iris.iloc[2:3,3:4]

       city
2  bareilly

In [14]:
# .loc[]
iris = pd.read_csv('table.csv')
iris
iris.loc[0:1,("name","city")]

    name     city
0  harry   rampur
1  rohan  kolkata

In [15]:
# dropping columns
iris = pd.read_csv('table.csv')
iris
iris.drop('marks',axis=1)

   Unnamed: 0    name       city
0           0   harry     rampur
1           1   rohan    kolkata
2           2  skillf   bareilly
3           3   shubh  antartica

In [16]:
# dropping rows
iris = pd.read_csv('table.csv')
iris
iris.drop([0,1],axis=0)

   Unnamed: 0    name  marks       city
2           2  skillf     24   bareilly
3           3   shubh     17  antartica

In [17]:
# more pandas functions
iris = pd.read_csv('table.csv')
iris
iris.min()
iris.max()
# iris.mean(), iris.median()

Unnamed: 0         3
name          skillf
marks             92
city          rampur
dtype: object

In [18]:
iris = pd.read_csv('table.csv')
def double_make(s):
    return s * 2
iris[['name','marks']].apply(double_make)

           name  marks
0    harryharry    184
1    rohanrohan     68
2  skillfskillf     48
3    shubhshubh     34

In [25]:
iris = pd.read_csv('table.csv')
def half(s):
    return s * 0.5
# iris[['name','marks']].apply(half)

In [28]:
iris['name'].value_counts()

name
harry     1
rohan     1
skillf    1
shubh     1
Name: count, dtype: int64

In [30]:
iris.sort_values(by = 'name')

   Unnamed: 0    name  marks       city
0           0   harry     92     rampur
1           1   rohan     34    kolkata
3           3   shubh     17  antartica
2           2  skillf     24   bareilly